---
title: AnalyticalPowerSourceData
classe: Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# AnalyticalPowerSourceData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double ApparentPowerRating { get; set; }` | `analyticalPowerSourceData.ApparentPowerRating` | Double |
| `Double TotalConnectedCurrent { get; }` | `analyticalPowerSourceData.TotalConnectedCurrent` | Double |
| `Double Voltage { get; set; }` | `analyticalPowerSourceData.Voltage` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```